M1cha/zephyr/include/zephyr/dt-bindings/pinctrl/hc32l13x-pinctrl.h
/*
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_HC32L13X_PINCTRL_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_HC32L13X_PINCTRL_H_

#include "hc32-pinctrl.h"

#define HCLK_OUT_PA01    HC32_PINMUX('A', 1, AF6)
#define HCLK_OUT_PA07    HC32_PINMUX('A', 7, AF3)
#define HCLK_OUT_PA09    HC32_PINMUX('A', 9, AF6)
#define I2C0_SCL_PA09    HC32_PINMUX('A', 9, AF4)
#define I2C0_SCL_PB06    HC32_PINMUX('B', 6, AF1)
#define I2C0_SCL_PB08    HC32_PINMUX('B', 8, AF1)
#define I2C0_SCL_PD01    HC32_PINMUX('D', 1, AF1)
#define I2C0_SDA_PA10    HC32_PINMUX('A', 10, AF4)
#define I2C0_SDA_PB07    HC32_PINMUX('B', 7, AF1)
#define I2C0_SDA_PB09    HC32_PINMUX('B', 9, AF1)
#define I2C0_SDA_PD00    HC32_PINMUX('D', 0, AF1)
#define I2C1_SCL_PA11    HC32_PINMUX('A', 11, AF3)
#define I2C1_SCL_PB10    HC32_PINMUX('B', 10, AF1)
#define I2C1_SCL_PB13    HC32_PINMUX('B', 13, AF2)
#define I2C1_SCL_PD06    HC32_PINMUX('D', 6, AF1)
#define I2C1_SDA_PA12    HC32_PINMUX('A', 12, AF3)
#define I2C1_SDA_PB11    HC32_PINMUX('B', 11, AF1)
#define I2C1_SDA_PB14    HC32_PINMUX('B', 14, AF2)
#define I2C1_SDA_PD07    HC32_PINMUX('D', 7, AF1)
#define IR_OUT_PA13      HC32_PINMUX('A', 13, AF1)
#define IR_OUT_PB09      HC32_PINMUX('B', 9, AF2)
#define IR_OUT_PC04      HC32_PINMUX('C', 4, AF3)
#define LPTIM_ETR_PB04   HC32_PINMUX('B', 4, AF7)
#define LPTIM_ETR_PB06   HC32_PINMUX('B', 6, AF5)
#define LPTIM_ETR_PC03   HC32_PINMUX('C', 3, AF2)
#define LPTIM_GATE_PB03  HC32_PINMUX('B', 3, AF5)
#define LPTIM_GATE_PB05  HC32_PINMUX('B', 5, AF5)
#define LPTIM_GATE_PC00  HC32_PINMUX('C', 0, AF1)
#define LPTIM_TOG_PB02   HC32_PINMUX('B', 2, AF1)
#define LPTIM_TOG_PB06   HC32_PINMUX('B', 6, AF7)
#define LPTIM_TOG_PC01   HC32_PINMUX('C', 1, AF1)
#define LPTIM_TOGN_PB07  HC32_PINMUX('B', 7, AF6)
#define LPTIM_TOGN_PC02  HC32_PINMUX('C', 2, AF2)
#define LPTIM_TOGN_PC03  HC32_PINMUX('C', 3, AF3)
#define LPUART0_CTS_PA06 HC32_PINMUX('A', 6, AF7)
#define LPUART0_CTS_PB13 HC32_PINMUX('B', 13, AF4)
#define LPUART0_RTS_PB01 HC32_PINMUX('B', 1, AF5)
#define LPUART0_RTS_PB12 HC32_PINMUX('B', 12, AF6)
#define LPUART0_RTS_PB14 HC32_PINMUX('B', 14, AF6)
#define LPUART0_RTS_PD02 HC32_PINMUX('D', 2, AF2)
#define LPUART0_RXD_PB11 HC32_PINMUX('B', 11, AF3)
#define LPUART0_RXD_PC05 HC32_PINMUX('C', 5, AF1)
#define LPUART0_RXD_PC11 HC32_PINMUX('C', 11, AF2)
#define LPUART0_TXD_PB00 HC32_PINMUX('B', 0, AF3)
#define LPUART0_TXD_PB10 HC32_PINMUX('B', 10, AF4)
#define LPUART0_TXD_PB12 HC32_PINMUX('B', 12, AF3)
#define LPUART0_TXD_PC04 HC32_PINMUX('C', 4, AF1)
#define LPUART0_TXD_PC10 HC32_PINMUX('C', 10, AF2)
#define LPUART0_TXD_PC12 HC32_PINMUX('C', 12, AF1)
#define LPUART1_CTS_PB07 HC32_PINMUX('B', 7, AF4)
#define LPUART1_CTS_PB11 HC32_PINMUX('B', 11, AF6)
#define LPUART1_CTS_PD06 HC32_PINMUX('D', 6, AF2)
#define LPUART1_RTS_PA15 HC32_PINMUX('A', 15, AF3)
#define LPUART1_RTS_PB10 HC32_PINMUX('B', 10, AF6)
#define LPUART1_RTS_PD07 HC32_PINMUX('D', 7, AF2)
#define LPUART1_RXD_PA01 HC32_PINMUX('A', 1, AF2)
#define LPUART1_RXD_PB15 HC32_PINMUX('B', 15, AF7)
#define LPUART1_RXD_PC11 HC32_PINMUX('C', 11, AF1)
#define LPUART1_TXD_PA00 HC32_PINMUX('A', 0, AF2)
#define LPUART1_TXD_PB02 HC32_PINMUX('B', 2, AF3)
#define LPUART1_TXD_PC10 HC32_PINMUX('C', 10, AF1)
#define LPUART1_TXD_PC12 HC32_PINMUX('C', 12, AF2)
#define LVD_OUT_PA04     HC32_PINMUX('A', 4, AF6)
#define LVD_OUT_PA13     HC32_PINMUX('A', 13, AF3)
#define LVD_OUT_PA14     HC32_PINMUX('A', 14, AF4)
#define PCA_CH0_PA06     HC32_PINMUX('A', 6, AF2)
#define PCA_CH0_PB04     HC32_PINMUX('B', 4, AF2)
#define PCA_CH0_PC06     HC32_PINMUX('C', 6, AF1)
#define PCA_CH1_PA07     HC32_PINMUX('A', 7, AF2)
#define PCA_CH1_PB05     HC32_PINMUX('B', 5, AF4)
#define PCA_CH1_PC07     HC32_PINMUX('C', 7, AF1)
#define PCA_CH2_PB00     HC32_PINMUX('B', 0, AF1)
#define PCA_CH2_PC08     HC32_PINMUX('C', 8, AF1)
#define PCA_CH2_PC10     HC32_PINMUX('C', 10, AF3)
#define PCA_CH3_PB01     HC32_PINMUX('B', 1, AF1)
#define PCA_CH3_PC09     HC32_PINMUX('C', 9, AF1)
#define PCA_CH3_PC11     HC32_PINMUX('C', 11, AF3)
#define PCA_CH4_PA04     HC32_PINMUX('A', 4, AF3)
#define PCA_CH4_PC05     HC32_PINMUX('C', 5, AF3)
#define PCA_CH4_PC12     HC32_PINMUX('C', 12, AF3)
#define PCA_ECI_PA05     HC32_PINMUX('A', 5, AF3)
#define PCA_ECI_PB02     HC32_PINMUX('B', 2, AF2)
#define PCA_ECI_PD02     HC32_PINMUX('D', 2, AF1)
#define PCLK_OUT_PA02    HC32_PINMUX('A', 2, AF6)
#define PCLK_OUT_PA10    HC32_PINMUX('A', 10, AF6)
#define PCLK_OUT_PB01    HC32_PINMUX('B', 1, AF2)
#define PCNT_S0_PA12     HC32_PINMUX('A', 12, AF7)
#define PCNT_S0_PB05     HC32_PINMUX('B', 5, AF6)
#define PCNT_S0_PC00     HC32_PINMUX('C', 0, AF2)
#define PCNT_S1_PA13     HC32_PINMUX('A', 13, AF6)
#define PCNT_S1_PB07     HC32_PINMUX('B', 7, AF7)
#define PCNT_S1_PC02     HC32_PINMUX('C', 2, AF3)
#define PLL_OUT_PA14     HC32_PINMUX('A', 14, AF7)
#define PLL_OUT_PB00     HC32_PINMUX('B', 0, AF7)
#define RCH_OUT_PA14     HC32_PINMUX('A', 14, AF5)
#define RCH_OUT_PB00     HC32_PINMUX('B', 0, AF5)
#define RCL_OUT_PA14     HC32_PINMUX('A', 14, AF6)
#define RCL_OUT_PB00     HC32_PINMUX('B', 0, AF6)
#define RTC_1HZ_PA13     HC32_PINMUX('A', 13, AF5)
#define RTC_1HZ_PB14     HC32_PINMUX('B', 14, AF5)
#define RTC_1HZ_PC13     HC32_PINMUX('C', 13, AF2)
#define SPI0_CS_PA04     HC32_PINMUX('A', 4, AF1)
#define SPI0_CS_PA15     HC32_PINMUX('A', 15, AF1)
#define SPI0_MISO_PA06   HC32_PINMUX('A', 6, AF1)
#define SPI0_MISO_PA11   HC32_PINMUX('A', 11, AF6)
#define SPI0_MISO_PB04   HC32_PINMUX('B', 4, AF1)
#define SPI0_MOSI_PA07   HC32_PINMUX('A', 7, AF1)
#define SPI0_MOSI_PA12   HC32_PINMUX('A', 12, AF6)
#define SPI0_MOSI_PB05   HC32_PINMUX('B', 5, AF1)
#define SPI0_SCK_PA05    HC32_PINMUX('A', 5, AF1)
#define SPI0_SCK_PB03    HC32_PINMUX('B', 3, AF1)
#define SPI1_CS_PA03     HC32_PINMUX('A', 3, AF5)
#define SPI1_CS_PB09     HC32_PINMUX('B', 9, AF3)
#define SPI1_CS_PB12     HC32_PINMUX('B', 12, AF1)
#define SPI1_MISO_PA02   HC32_PINMUX('A', 2, AF7)
#define SPI1_MISO_PB14   HC32_PINMUX('B', 14, AF1)
#define SPI1_MISO_PC02   HC32_PINMUX('C', 2, AF1)
#define SPI1_MOSI_PA01   HC32_PINMUX('A', 1, AF7)
#define SPI1_MOSI_PB15   HC32_PINMUX('B', 15, AF1)
#define SPI1_MOSI_PC03   HC32_PINMUX('C', 3, AF1)
#define SPI1_SCK_PB10    HC32_PINMUX('B', 10, AF2)
#define SPI1_SCK_PB13    HC32_PINMUX('B', 13, AF1)
#define TIM0_BK_PA09     HC32_PINMUX('A', 9, AF3)
#define TIM0_BK_PB02     HC32_PINMUX('B', 2, AF6)
#define TIM0_BK_PB12     HC32_PINMUX('B', 12, AF4)
#define TIM0_CHA_PA00    HC32_PINMUX('A', 0, AF7)
#define TIM0_CHA_PA02    HC32_PINMUX('A', 2, AF2)
#define TIM0_CHA_PA05    HC32_PINMUX('A', 5, AF4)
#define TIM0_CHA_PA15    HC32_PINMUX('A', 15, AF5)
#define TIM0_CHA_PB06    HC32_PINMUX('B', 6, AF4)
#define TIM0_CHA_PB14    HC32_PINMUX('B', 14, AF4)
#define TIM0_CHB_PA01    HC32_PINMUX('A', 1, AF3)
#define TIM0_CHB_PB03    HC32_PINMUX('B', 3, AF2)
#define TIM0_CHB_PB07    HC32_PINMUX('B', 7, AF5)
#define TIM0_CHB_PB15    HC32_PINMUX('B', 15, AF3)
#define TIM0_ETR_PA00    HC32_PINMUX('A', 0, AF3)
#define TIM0_ETR_PA05    HC32_PINMUX('A', 5, AF2)
#define TIM0_ETR_PA15    HC32_PINMUX('A', 15, AF4)
#define TIM0_GATE_PA03   HC32_PINMUX('A', 3, AF2)
#define TIM0_GATE_PB08   HC32_PINMUX('B', 8, AF5)
#define TIM0_GATE_PB15   HC32_PINMUX('B', 15, AF4)
#define TIM1_BK_PB02     HC32_PINMUX('B', 2, AF5)
#define TIM1_BK_PB05     HC32_PINMUX('B', 5, AF3)
#define TIM1_BK_PB14     HC32_PINMUX('B', 14, AF7)
#define TIM1_CHA_PA00    HC32_PINMUX('A', 0, AF5)
#define TIM1_CHA_PA02    HC32_PINMUX('A', 2, AF4)
#define TIM1_CHA_PA06    HC32_PINMUX('A', 6, AF4)
#define TIM1_CHA_PB08    HC32_PINMUX('B', 8, AF2)
#define TIM1_CHA_PB10    HC32_PINMUX('B', 10, AF3)
#define TIM1_CHA_PB13    HC32_PINMUX('B', 13, AF5)
#define TIM1_CHB_PA01    HC32_PINMUX('A', 1, AF5)
#define TIM1_CHB_PA03    HC32_PINMUX('A', 3, AF3)
#define TIM1_CHB_PB06    HC32_PINMUX('B', 6, AF3)
#define TIM1_CHB_PB11    HC32_PINMUX('B', 11, AF2)
#define TIM1_ETR_PA01    HC32_PINMUX('A', 1, AF4)
#define TIM1_ETR_PC09    HC32_PINMUX('C', 9, AF3)
#define TIM1_ETR_PD02    HC32_PINMUX('D', 2, AF3)
#define TIM1_GATE_PA08   HC32_PINMUX('A', 8, AF5)
#define TIM1_GATE_PB03   HC32_PINMUX('B', 3, AF3)
#define TIM1_GATE_PB13   HC32_PINMUX('B', 13, AF6)
#define TIM2_BK_PA10     HC32_PINMUX('A', 10, AF3)
#define TIM2_BK_PB02     HC32_PINMUX('B', 2, AF7)
#define TIM2_BK_PB04     HC32_PINMUX('B', 4, AF3)
#define TIM2_CHA_PA02    HC32_PINMUX('A', 2, AF5)
#define TIM2_CHA_PA07    HC32_PINMUX('A', 7, AF5)
#define TIM2_CHA_PB08    HC32_PINMUX('B', 8, AF4)
#define TIM2_CHA_PB09    HC32_PINMUX('B', 9, AF4)
#define TIM2_CHA_PC06    HC32_PINMUX('C', 6, AF3)
#define TIM2_CHB_PA03    HC32_PINMUX('A', 3, AF4)
#define TIM2_CHB_PB07    HC32_PINMUX('B', 7, AF3)
#define TIM2_CHB_PB09    HC32_PINMUX('B', 9, AF6)
#define TIM2_CHB_PC07    HC32_PINMUX('C', 7, AF3)
#define TIM2_ETR_PA04    HC32_PINMUX('A', 4, AF4)
#define TIM2_ETR_PC04    HC32_PINMUX('C', 4, AF2)
#define TIM2_ETR_PC08    HC32_PINMUX('C', 8, AF3)
#define TIM2_GATE_PA10   HC32_PINMUX('A', 10, AF5)
#define TIM2_GATE_PB04   HC32_PINMUX('B', 4, AF5)
#define TIM2_GATE_PB11   HC32_PINMUX('B', 11, AF4)
#define TIM3_BK_PA06     HC32_PINMUX('A', 6, AF3)
#define TIM3_BK_PA08     HC32_PINMUX('A', 8, AF7)
#define TIM3_BK_PB12     HC32_PINMUX('B', 12, AF2)
#define TIM3_CH0A_PA08   HC32_PINMUX('A', 8, AF2)
#define TIM3_CH0A_PB03   HC32_PINMUX('B', 3, AF4)
#define TIM3_CH0A_PB06   HC32_PINMUX('B', 6, AF6)
#define TIM3_CH0B_PA07   HC32_PINMUX('A', 7, AF4)
#define TIM3_CH0B_PB04   HC32_PINMUX('B', 4, AF6)
#define TIM3_CH0B_PB13   HC32_PINMUX('B', 13, AF3)
#define TIM3_CH1A_PA03   HC32_PINMUX('A', 3, AF6)
#define TIM3_CH1A_PA09   HC32_PINMUX('A', 9, AF2)
#define TIM3_CH1A_PA15   HC32_PINMUX('A', 15, AF6)
#define TIM3_CH1A_PB10   HC32_PINMUX('B', 10, AF5)
#define TIM3_CH1B_PB00   HC32_PINMUX('B', 0, AF2)
#define TIM3_CH1B_PB14   HC32_PINMUX('B', 14, AF3)
#define TIM3_CH1B_PC13   HC32_PINMUX('C', 13, AF3)
#define TIM3_CH2A_PA10   HC32_PINMUX('A', 10, AF2)
#define TIM3_CH2A_PA14   HC32_PINMUX('A', 14, AF3)
#define TIM3_CH2A_PB08   HC32_PINMUX('B', 8, AF6)
#define TIM3_CH2B_PA04   HC32_PINMUX('A', 4, AF7)
#define TIM3_CH2B_PB01   HC32_PINMUX('B', 1, AF3)
#define TIM3_CH2B_PB15   HC32_PINMUX('B', 15, AF2)
#define TIM3_ETR_PA00    HC32_PINMUX('A', 0, AF6)
#define TIM3_ETR_PA12    HC32_PINMUX('A', 12, AF2)
#define TIM3_ETR_PA13    HC32_PINMUX('A', 13, AF4)
#define TIM3_GATE_PA06   HC32_PINMUX('A', 6, AF6)
#define TIM3_GATE_PA11   HC32_PINMUX('A', 11, AF2)
#define TIM4_CHA_PA08    HC32_PINMUX('A', 8, AF6)
#define TIM4_CHA_PB02    HC32_PINMUX('B', 2, AF4)
#define TIM4_CHA_PC06    HC32_PINMUX('C', 6, AF2)
#define TIM4_CHB_PA07    HC32_PINMUX('A', 7, AF7)
#define TIM4_CHB_PA11    HC32_PINMUX('A', 11, AF7)
#define TIM4_CHB_PC09    HC32_PINMUX('C', 9, AF2)
#define TIM4_CHB_PD01    HC32_PINMUX('D', 1, AF2)
#define TIM5_CHA_PA03    HC32_PINMUX('A', 3, AF7)
#define TIM5_CHA_PA04    HC32_PINMUX('A', 4, AF5)
#define TIM5_CHA_PA09    HC32_PINMUX('A', 9, AF7)
#define TIM5_CHA_PC07    HC32_PINMUX('C', 7, AF2)
#define TIM5_CHB_PA05    HC32_PINMUX('A', 5, AF5)
#define TIM5_CHB_PB00    HC32_PINMUX('B', 0, AF4)
#define TIM5_CHB_PC01    HC32_PINMUX('C', 1, AF2)
#define TIM6_CHA_PA10    HC32_PINMUX('A', 10, AF7)
#define TIM6_CHA_PB11    HC32_PINMUX('B', 11, AF5)
#define TIM6_CHA_PB12    HC32_PINMUX('B', 12, AF7)
#define TIM6_CHA_PC08    HC32_PINMUX('C', 8, AF2)
#define TIM6_CHB_PB01    HC32_PINMUX('B', 1, AF4)
#define TIM6_CHB_PB13    HC32_PINMUX('B', 13, AF7)
#define TIM6_CHB_PC05    HC32_PINMUX('C', 5, AF2)
#define UART0_CTS_PA11   HC32_PINMUX('A', 11, AF1)
#define UART0_CTS_PB04   HC32_PINMUX('B', 4, AF4)
#define UART0_CTS_PD06   HC32_PINMUX('D', 6, AF3)
#define UART0_RTS_PA12   HC32_PINMUX('A', 12, AF1)
#define UART0_RTS_PB05   HC32_PINMUX('B', 5, AF7)
#define UART0_RTS_PD07   HC32_PINMUX('D', 7, AF3)
#define UART0_RXD_PA10   HC32_PINMUX('A', 10, AF1)
#define UART0_RXD_PA13   HC32_PINMUX('A', 13, AF2)
#define UART0_RXD_PB07   HC32_PINMUX('B', 7, AF2)
#define UART0_RXD_PB09   HC32_PINMUX('B', 9, AF7)
#define UART0_TXD_PA08   HC32_PINMUX('A', 8, AF1)
#define UART0_TXD_PA09   HC32_PINMUX('A', 9, AF1)
#define UART0_TXD_PA14   HC32_PINMUX('A', 14, AF2)
#define UART0_TXD_PB06   HC32_PINMUX('B', 6, AF2)
#define UART0_TXD_PB08   HC32_PINMUX('B', 8, AF7)
#define UART1_CTS_PA00   HC32_PINMUX('A', 0, AF1)
#define UART1_CTS_PB11   HC32_PINMUX('B', 11, AF7)
#define UART1_CTS_PC00   HC32_PINMUX('C', 0, AF3)
#define UART1_RTS_PA01   HC32_PINMUX('A', 1, AF1)
#define UART1_RTS_PB10   HC32_PINMUX('B', 10, AF7)
#define UART1_RTS_PC01   HC32_PINMUX('C', 1, AF3)
#define UART1_RXD_PA03   HC32_PINMUX('A', 3, AF1)
#define UART1_RXD_PA15   HC32_PINMUX('A', 15, AF2)
#define UART1_RXD_PD01   HC32_PINMUX('D', 1, AF3)
#define UART1_TXD_PA02   HC32_PINMUX('A', 2, AF1)
#define UART1_TXD_PA04   HC32_PINMUX('A', 4, AF2)
#define UART1_TXD_PA14   HC32_PINMUX('A', 14, AF1)
#define UART1_TXD_PD00   HC32_PINMUX('D', 0, AF3)
#define VC0_OUT_PA00     HC32_PINMUX('A', 0, AF4)
#define VC0_OUT_PA06     HC32_PINMUX('A', 6, AF5)
#define VC0_OUT_PA11     HC32_PINMUX('A', 11, AF5)
#define VC1_OUT_PA02     HC32_PINMUX('A', 2, AF3)
#define VC1_OUT_PA07     HC32_PINMUX('A', 7, AF6)
#define VC1_OUT_PA12     HC32_PINMUX('A', 12, AF5)
#define XTH_OUT_PA05     HC32_PINMUX('A', 5, AF7)
#define XTH_OUT_PB03     HC32_PINMUX('B', 3, AF7)
#define XTL_OUT_PA05     HC32_PINMUX('A', 5, AF6)
#define XTL_OUT_PB03     HC32_PINMUX('B', 3, AF6)

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_HC32L13X_PINCTRL_H_ */
